Revit 2026 API

# SATExportOptions Properties

---

The SATExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

SATExportOptions Class

Autodesk.Revit.DB Namespace